cask_args appdir: "/Applications"
tap "caskroom/cask"
cask "google-chrome"
cask "google-japanese-ime"
cask "virtualbox"
cask "iterm2"
cask "alfred"
cask "bettertouchtool"
cask "docker"
cask "vagrant"
cask "visual-studio-code"
cask "java" unless system "/usr/libexec/java_home --failfast"

mas "1Password", id: 443987910
mas "Slack", id: 803453959
mas "Kobito", id: 896624060
mas "BetterSnapTool", id: 417375580
mas "The Unarchiver", id: 425424353
mas "Keynote", id: 409183694

brew "zsh"
brew "tmux"
brew "wget"
brew "jq"
brew "ghq"
brew "fzf"
brew "python"
brew "reattach-to-user-namespace"
brew "go"
brew "coreutils"
brew "pwgen"
brew "kubectl"
